In [171]:
import pandas as pd
import requests

ep = "https://raw.githubusercontent.com/stundrg/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [172]:
res = requests.get(ep)

In [143]:
# res.status_code

In [144]:
# res.encoding

In [145]:
# res.text

In [173]:
data = res.json()

In [174]:
type(data)

dict

In [175]:
data['endpoints']

[{'name': 'TOM', 'url': 'https://ac.sunsin.shop/api/py/select_all'},
 {'name': 'jiwon', 'url': 'https://agecal.wodan10.shop/api/py/select_all'},
 {'name': 'heejin', 'url': 'https://age.journeyjean.shop/api/py/select_all'},
 {'name': 'hyun',
  'url': 'https://agecalculator.calcalhan.store/api/py/select_all'},
 {'name': 'cho',
  'url': 'https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all'},
 {'name': 'jacob', 'url': 'https://jacob0503.vercel.app/api/py/select_table'},
 {'name': 'nuni', 'url': 'https://ac.nunininu.shop/api/py/select_all'},
 {'name': 'lucas', 'url': 'https://ac.lucas12.store/api/py/select_all'},
 {'name': 'SEO', 'url': 'https://ac.seo-sigma.shop/api/py/select_all'},
 {'name': 'JERRY', 'url': 'https://jooon.vercel.app/api/py/select_all'}]

In [176]:
endpoints = data['endpoints']
type(endpoints)

list

In [177]:
for p in endpoints:
    print(f'{p["name"]},{p["url"]}')

TOM,https://ac.sunsin.shop/api/py/select_all
jiwon,https://agecal.wodan10.shop/api/py/select_all
heejin,https://age.journeyjean.shop/api/py/select_all
hyun,https://agecalculator.calcalhan.store/api/py/select_all
cho,https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob,https://jacob0503.vercel.app/api/py/select_table
nuni,https://ac.nunininu.shop/api/py/select_all
lucas,https://ac.lucas12.store/api/py/select_all
SEO,https://ac.seo-sigma.shop/api/py/select_all
JERRY,https://jooon.vercel.app/api/py/select_all

In [178]:
# df_hyun = 
# df_jerry = 
res = requests.get("https://agecalculator.calcalhan.store/api/py/select_all")
#res.status.code
data = res.json()
df_hyun = pd.DataFrame(data)
df_hyun.head(1)

  menu_name  name          dt
0       햄버거  hyun  2025-01-01

In [179]:
# 나의 df에 없는 row를 골라서 새로운 df으로 만들기
new_rows = []

# df_jerry의 각 행을 돌면서
for _, row_j in df_jerry.iterrows():
    is_match_row = True
    # df_jerry의 각 열에 대해 df_hyun과 비교
    for _, row_h in df_hyun.iterrows():
        is_match_columns = True
        for c_name in df_hyun.columns:
            if row_j[c_name] != row_h[c_name]:
            print(row)

    if not is_match_row:
        new_rows.apeend(row)

df_new = pd.DataFrame(new_rows)

IndentationError: expected an indented block after 'if' statement on line 11 (4009239613.py, line 12)

In [153]:
import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4], "name": ["MIN", "LEE", "PARK"]})

In [190]:
new_rows = []

for _, row_3 in df_jerry.iterrows():
    is_match_row = False
    for _, row_1 in df_hyun.iterrows():
        is_match_columns = True
        for c_name in df_jerry.columns:
            if row_3[c_name] != row_1[c_name]:
                is_match_columns = False
                break
        if is_match_columns:
            is_match_row = True
    if is_match_row:
        pass
    else:
        new_rows.append(row_3)

df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

        menu_name    name          dt
0     베이컨토마토디럭스세트   JERRY  2025-02-06
2             닭개장     CHO  2025-01-07
3    닭개장(특) , 꽈배기    HYUN  2025-01-07
6             닭개장   JIWON  2025-01-07
7             자장면   JACOB  2025-01-07
..            ...     ...         ...
140         김치 찌개   JACOB  2025-02-03
141          샌드위치  HEEJIN  2025-02-03
142          제육볶음   LUCAS  2025-02-03
143          제육볶음    NUNI  2025-02-03
144            라면   JERRY  2025-02-09

[103 rows x 3 columns]

In [155]:
merge_df = pd.merge(df1, df3, how='right',indicator=True)

In [156]:
merge_df

   id  name      _merge
0   5   TOM  right_only
1   4  PARK  right_only
2   2   MIN        both
3   3   LEE        both

In [157]:
df_diff_3 = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge', axis=1)
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [158]:
# _merge == right_only 만 남기고
merge_df_filtered = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge', axis=1)
# _merge 컬럼은 지우고
# merge_df_filtered = merge_df_filtered.drop(columns=['_merge'])


merge_df_filtered

   id  name
0   5   TOM
1   4  PARK

In [159]:
import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4], "name": ["MIN", "LEE", "PARK"]})

In [183]:
from pandasql import sqldf
query = """
select 
	df_jerry.menu_name, df_jerry.name, df_jerry.dt
from 
	df_jerry 
left join 
	df_hyun 
on df_jerry.menu_name = df_hyun.menu_name AND df_jerry.name = df_hyun.name AND df_jerry.dt = df_hyun.dt
where df_hyun.menu_name is null
"""

pysqldf = lambda q: sqldf(q,globals())

def pysqldf(q):
    sqldf(q, locals())
df_diff_1 =sqldf(query,locals())
df_diff_1

        menu_name    name          dt
0     베이컨토마토디럭스세트   JERRY  2025-02-06
1             닭개장     CHO  2025-01-07
2    닭개장(특) , 꽈배기    HYUN  2025-01-07
3             닭개장   JIWON  2025-01-07
4             자장면   JACOB  2025-01-07
..            ...     ...         ...
98          김치 찌개   JACOB  2025-02-03
99           샌드위치  HEEJIN  2025-02-03
100          제육볶음   LUCAS  2025-02-03
101          제육볶음    NUNI  2025-02-03
102            라면   JERRY  2025-02-09

[103 rows x 3 columns]

In [161]:
import pandasql as sqldf

In [162]:
## TODO
# df_diff_1, df_diff_2, df_diff_3

In [163]:
df_diff_1

   id  name
0   5   TOM
1   4  PARK

In [164]:
df_diff_2

   id  name
0   5   TOM
1   4  PARK

In [165]:
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [167]:
df_diff_1.reset_index(drop=True).equals(df_diff_2.reset_index(drop=True))

True

In [168]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

True

In [169]:
df_diff_1.reset_index(drop=True)

   id  name
0   5   TOM
1   4  PARK

In [170]:
df_diff_3.reset_index(drop=True)

   id  name
0   5   TOM
1   4  PARK

In [166]:
df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [184]:
df_diff_3.columns.tolist()

['id', 'name']

In [ ]:
d3 = df_new.sort_values(